# Pandas Notes

### Python 原生数据结构没有二维表
### Pandas 为Python数据分析底层标准架构

In [1]:
import pandas as pd

# 设定自由列表输出10行
pd.options.display.max_rows = 20

# 显示pandas版本号
pd.__version__

'1.1.5'

 # 1 数据获取

### 1.1 新建数据框

In [8]:
# 拼接数据列，字典格式
df1 = pd.DataFrame(
{
'Version': 1.0,
'Code': [1,2,3,4],
'Type': ['test','quiz','test','quiz'],
'Evaluation': 'cons'
}                 )
df1

   Version  Code  Type Evaluation
0      1.0     1  test       cons
1      1.0     2  quiz       cons
2      1.0     3  test       cons
3      1.0     4  quiz       cons

In [3]:
# list按行提供数据
df2 = pd.DataFrame(data = [[1,'test'],[2,'quiz'],[3,'test'],[4,'quiz']],
                   columns = ['var2', 'var3']
                  )
df2

   var2  var3
0     1  test
1     2  quiz
2     3  test
3     4  quiz

In [4]:
s1 = pd.Series(['test','quiz','test','quiz'], name = 'var3')
s1

0    test
1    quiz
2    test
3    quiz
Name: var3, dtype: object

In [5]:
# 数据框的每一列就是一个series
print(type(df1.var3))
df1.var3

<class 'pandas.core.series.Series'>

0    test
1    quiz
2    test
3    quiz
Name: var3, dtype: object

### 1.2 读入文本格式数据文件

In [6]:
df3 = pd.read_csv('transtest.CSV', sep = ',', header = 0)
df3

,GEOID,STATE,STATE_NAME,COUNTY,COUNTY_NAME,pov_idx,lbr_idx,haz_idx,tcost_idx,trans_idx
0,1001020700,1,Alabama,1,Autauga,27.0,36.0,17.0,24.0,28.0
1,1003010200,1,Alabama,3,Baldwin,16.0,30.0,55.0,25.0,29.0
2,1003010400,1,Alabama,3,Baldwin,47.0,29.0,59.0,18.0,32.0
3,1003010500,1,Alabama,3,Baldwin,38.0,22.0,47.0,28.0,0.0
4,1003010600,1,Alabama,3,Baldwin,17.0,25.0,39.0,29.0,22.0
...,...,...,...,...,...,...,...,...,...,...
8684,72153750501,72,Puerto Rico,153,Yauco,4.0,10.0,88.0,NaN,NaN
8685,72153750502,72,Puerto Rico,153,Yauco,5.0,3.0,88.0,NaN,NaN
8686,72153750503,72,Puerto Rico,153,Yauco,2.0,5.0,90.0,NaN,NaN
8687,72153750601,72,Puerto Rico,153,Yauco,8.0,5.0,91.0,NaN,NaN
8688,72153750602,72,Puerto Rico,153,Yauco,0.0,0.0,92.0,NaN,NaN

### 1.3 查看数据基本情况

In [7]:
# 查看前后几行数据
df3.head(6)
df3.tail(6)

,GEOID,STATE,STATE_NAME,COUNTY,COUNTY_NAME,pov_idx,lbr_idx,haz_idx,tcost_idx,trans_idx
8683,72153750400,72,Puerto Rico,153,Yauco,0.0,1.0,89.0,NaN,NaN
8684,72153750501,72,Puerto Rico,153,Yauco,4.0,10.0,88.0,NaN,NaN
8685,72153750502,72,Puerto Rico,153,Yauco,5.0,3.0,88.0,NaN,NaN
8686,72153750503,72,Puerto Rico,153,Yauco,2.0,5.0,90.0,NaN,NaN
8687,72153750601,72,Puerto Rico,153,Yauco,8.0,5.0,91.0,NaN,NaN
8688,72153750602,72,Puerto Rico,153,Yauco,0.0,0.0,92.0,NaN,NaN

In [8]:
# 查看数据形状 rows columns
df3.shape

(8689, 10)

In [9]:
# 查看列名
df3.columns

Index(['GEOID', 'STATE', 'STATE_NAME', 'COUNTY', 'COUNTY_NAME', 'pov_idx',
       'lbr_idx', 'haz_idx', 'tcost_idx', 'trans_idx'],
      dtype='object')

In [10]:
# 查看每列数据类型
df3.dtypes

GEOID            int64
STATE            int64
STATE_NAME      object
COUNTY           int64
COUNTY_NAME     object
pov_idx        float64
lbr_idx        float64
haz_idx        float64
tcost_idx      float64
trans_idx      float64
dtype: object

In [11]:
# 查看索引列
df3.index

RangeIndex(start=0, stop=8689, step=1)

# 2 数据修改

In [12]:
# 换索引
df4 = df3.copy()
df4.set_index('GEOID', inplace = True)
df4

,STATE,STATE_NAME,COUNTY,COUNTY_NAME,pov_idx,lbr_idx,haz_idx,tcost_idx,trans_idx
GEOID,,,,,,,,,
1001020700,1,Alabama,1,Autauga,27.0,36.0,17.0,24.0,28.0
1003010200,1,Alabama,3,Baldwin,16.0,30.0,55.0,25.0,29.0
1003010400,1,Alabama,3,Baldwin,47.0,29.0,59.0,18.0,32.0
1003010500,1,Alabama,3,Baldwin,38.0,22.0,47.0,28.0,0.0
1003010600,1,Alabama,3,Baldwin,17.0,25.0,39.0,29.0,22.0
...,...,...,...,...,...,...,...,...,...
72153750501,72,Puerto Rico,153,Yauco,4.0,10.0,88.0,NaN,NaN
72153750502,72,Puerto Rico,153,Yauco,5.0,3.0,88.0,NaN,NaN
72153750503,72,Puerto Rico,153,Yauco,2.0,5.0,90.0,NaN,NaN
72153750601,72,Puerto Rico,153,Yauco,8.0,5.0,91.0,NaN,NaN
72153750602,72,Puerto Rico,153,Yauco,0.0,0.0,92.0,NaN,NaN

In [13]:
# 改索引名
df4.rename(str.lower, axis='columns', inplace = True)
df4.rename(columns = {'state_name':'statename', 'county_name':'countyname'}, inplace = True)
df4

,state,statename,county,countyname,pov_idx,lbr_idx,haz_idx,tcost_idx,trans_idx
GEOID,,,,,,,,,
1001020700,1,Alabama,1,Autauga,27.0,36.0,17.0,24.0,28.0
1003010200,1,Alabama,3,Baldwin,16.0,30.0,55.0,25.0,29.0
1003010400,1,Alabama,3,Baldwin,47.0,29.0,59.0,18.0,32.0
1003010500,1,Alabama,3,Baldwin,38.0,22.0,47.0,28.0,0.0
1003010600,1,Alabama,3,Baldwin,17.0,25.0,39.0,29.0,22.0
...,...,...,...,...,...,...,...,...,...
72153750501,72,Puerto Rico,153,Yauco,4.0,10.0,88.0,NaN,NaN
72153750502,72,Puerto Rico,153,Yauco,5.0,3.0,88.0,NaN,NaN
72153750503,72,Puerto Rico,153,Yauco,2.0,5.0,90.0,NaN,NaN
72153750601,72,Puerto Rico,153,Yauco,8.0,5.0,91.0,NaN,NaN
72153750602,72,Puerto Rico,153,Yauco,0.0,0.0,92.0,NaN,NaN

In [14]:
# 删除
df4.drop(df4[df4['state'] == 72].index, inplace = True)
df4.drop(df4.index[df4['state'] == 72], inplace = True)
df4

,state,statename,county,countyname,pov_idx,lbr_idx,haz_idx,tcost_idx,trans_idx
GEOID,,,,,,,,,
1001020700,1,Alabama,1,Autauga,27.0,36.0,17.0,24.0,28.0
1003010200,1,Alabama,3,Baldwin,16.0,30.0,55.0,25.0,29.0
1003010400,1,Alabama,3,Baldwin,47.0,29.0,59.0,18.0,32.0
1003010500,1,Alabama,3,Baldwin,38.0,22.0,47.0,28.0,0.0
1003010600,1,Alabama,3,Baldwin,17.0,25.0,39.0,29.0,22.0
...,...,...,...,...,...,...,...,...,...
56031959100,56,Wyoming,31,Platte,35.0,59.0,99.0,8.0,0.0
56031959400,56,Wyoming,31,Platte,37.0,69.0,99.0,6.0,0.0
56037970903,56,Wyoming,37,Sweetwater,33.0,46.0,74.0,73.0,82.0
56041975400,56,Wyoming,41,Uinta,32.0,39.0,90.0,36.0,45.0
56043000301,56,Wyoming,43,Washakie,43.0,60.0,64.0,23.0,13.0

In [15]:
# 替换字符
df4.loc[:,'trans_idx'] = df4['trans_idx'].replace(0, 1)
df4

,state,statename,county,countyname,pov_idx,lbr_idx,haz_idx,tcost_idx,trans_idx
GEOID,,,,,,,,,
1001020700,1,Alabama,1,Autauga,27.0,36.0,17.0,24.0,28.0
1003010200,1,Alabama,3,Baldwin,16.0,30.0,55.0,25.0,29.0
1003010400,1,Alabama,3,Baldwin,47.0,29.0,59.0,18.0,32.0
1003010500,1,Alabama,3,Baldwin,38.0,22.0,47.0,28.0,1.0
1003010600,1,Alabama,3,Baldwin,17.0,25.0,39.0,29.0,22.0
...,...,...,...,...,...,...,...,...,...
56031959100,56,Wyoming,31,Platte,35.0,59.0,99.0,8.0,1.0
56031959400,56,Wyoming,31,Platte,37.0,69.0,99.0,6.0,1.0
56037970903,56,Wyoming,37,Sweetwater,33.0,46.0,74.0,73.0,82.0
56041975400,56,Wyoming,41,Uinta,32.0,39.0,90.0,36.0,45.0
56043000301,56,Wyoming,43,Washakie,43.0,60.0,64.0,23.0,13.0

In [16]:
# 改变量
df4.loc[1003010200, 'pov_idx'] = 20
df4

,state,statename,county,countyname,pov_idx,lbr_idx,haz_idx,tcost_idx,trans_idx
GEOID,,,,,,,,,
1001020700,1,Alabama,1,Autauga,27.0,36.0,17.0,24.0,28.0
1003010200,1,Alabama,3,Baldwin,20.0,30.0,55.0,25.0,29.0
1003010400,1,Alabama,3,Baldwin,47.0,29.0,59.0,18.0,32.0
1003010500,1,Alabama,3,Baldwin,38.0,22.0,47.0,28.0,1.0
1003010600,1,Alabama,3,Baldwin,17.0,25.0,39.0,29.0,22.0
...,...,...,...,...,...,...,...,...,...
56031959100,56,Wyoming,31,Platte,35.0,59.0,99.0,8.0,1.0
56031959400,56,Wyoming,31,Platte,37.0,69.0,99.0,6.0,1.0
56037970903,56,Wyoming,37,Sweetwater,33.0,46.0,74.0,73.0,82.0
56041975400,56,Wyoming,41,Uinta,32.0,39.0,90.0,36.0,45.0
56043000301,56,Wyoming,43,Washakie,43.0,60.0,64.0,23.0,13.0

# 3 数据查询

In [17]:
# 查询单个值
# .at get single value by row & column
# .iat pure interger location

v2 = df4.at[1003010200, 'countyname']
v3 = df4.iat[1, 3]
print(v2, end = '\n\n')
print(v3)

Baldwin

Baldwin

In [18]:
# 不用函数查询数据，列，行
s22 = df4['statename'][:6]
s23 = df4[['statename', 'countyname']][:6]
print(s22, '\n\n', s23)

GEOID
1001020700    Alabama
1003010200    Alabama
1003010400    Alabama
1003010500    Alabama
1003010600    Alabama
1003011501    Alabama
Name: statename, dtype: object

            statename countyname
GEOID
1001020700   Alabama    Autauga
1003010200   Alabama    Baldwin
1003010400   Alabama    Baldwin
1003010500   Alabama    Baldwin
1003010600   Alabama    Baldwin
1003011501   Alabama    Baldwin

In [19]:
# loc, iloc 查询位置, 行， 列
# .loc get values of given index name
# .iloc pure interger location
s3 = df4.loc[[1003010400, 1003010500],['statename', 'countyname']]
s4 = df4.iloc[:2, :4]
print(s3, '\n\n', s4)

           statename countyname
GEOID
1003010400   Alabama    Baldwin
1003010500   Alabama    Baldwin

             state statename  county countyname
GEOID
1001020700      1   Alabama       1    Autauga
1003010200      1   Alabama       3    Baldwin

In [20]:
# bool索引
df5 = df4.copy()
s51 =  df5['pov_idx'] > 90
s52 =  df5.loc[df5['pov_idx'] > 90].iloc[:,:5]
print(s51, '\n\n', s52)

GEOID
1001020700     False
1003010200     False
1003010400     False
1003010500     False
1003010600     False
               ...
56031959100    False
56031959400    False
56037970903    False
56041975400    False
56043000301    False
Name: pov_idx, Length: 7826, dtype: bool

              state     statename  county       countyname  pov_idx
GEOID
6037980014       6    California      37      Los Angeles     99.0
6079010902       6    California      79  San Luis Obispo     95.0
8041004008       8      Colorado      41          El Paso     97.0
8101003106       8      Colorado     101           Pueblo     93.0
17019000402     17      Illinois      19        Champaign     94.0
24003740603     24      Maryland       3     Anne Arundel     94.0
24009861003     24      Maryland       9          Calvert     96.0
24033803519     24      Maryland      33  Prince George's     93.0
26125197600     26      Michigan     125          Oakland     93.0
26161446200     26      Michigan     161        Washtenaw     99.0
40109103601     40      Oklahoma     109         Oklahoma     99.0
42063961102     42  Pennsylvania      63          Indiana     98.0
42101980000     42  Pennsylvania     101     Philadelphia     99.0
48029980002     48         Texas      29            Bexar     99.0
48029980100     48         Texas      29            Bexar     99.0

# 4 连续变量的统计描述

In [21]:
df5.trans_idx.min()

1.0

In [22]:
df5.groupby('statename').pov_idx.mean()

statename
Alabama          18.531646
Alaska           41.160000
Arizona          18.475904
Arkansas         17.635294
California       16.086462
                   ...
Virginia         35.688679
Washington       27.258993
West Virginia    29.363636
Wisconsin        25.066667
Wyoming          37.480000
Name: pov_idx, Length: 51, dtype: float64

# 5 数值运算

In [23]:
#基本运算
df5[:4][ 'pov_idx'].sum()

132.0

In [24]:
# 带条件的运算
df5[df5['pov_idx'] >= 90]['pov_idx'].mean()

95.38888888888889

In [25]:
# 统计数据出现次数
s61 = df5['pov_idx'].value_counts(ascending = True)
s62 = df5['trans_idx'].value_counts(bins = 10)

print(s61, '\n\n', s62)

95.0      1
98.0      1
96.0      1
97.0      1
94.0      2
       ...
5.0     259
1.0     260
2.0     263
4.0     272
3.0     288
Name: pov_idx, Length: 98, dtype: int64

 (0.901, 10.8]    1295
(89.2, 99.0]     1142
(79.4, 89.2]      994
(69.6, 79.4]      792
(59.8, 69.6]      699
(40.2, 50.0]      616
(10.8, 20.6]      603
(30.4, 40.2]      568
(50.0, 59.8]      558
(20.6, 30.4]      546
Name: trans_idx, dtype: int64

In [26]:
# 统计不为0的数据个数

s63 = df5['pov_idx'].count()
s64 = df5['trans_idx'].count()
print(s63, s64)

7821 7813

# 数据清洗

In [27]:
import pandas as pd

df6 = pd.read_csv('dataclean.csv')
df6

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [28]:
df6.iloc[:, 1].isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
Name: ST_NUM, dtype: bool

In [29]:
# na 不是空数据
df6.loc[:, 'NUM_BEDROOMS'].isnull()

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8    False
Name: NUM_BEDROOMS, dtype: bool

In [30]:
# HURLEY 不是空数据
df6.loc[:, 'NUM_BATH'].isnull()

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7    False
8    False
Name: NUM_BATH, dtype: bool

In [31]:
missingvalue = ['na', 'n/a', '--']
df7 = pd.read_csv('dataclean.csv', na_values = missingvalue)

print(df7['NUM_BEDROOMS'], end = '\n\n')
print(df7['NUM_BEDROOMS'].isnull())

0    3.0
1    3.0
2    NaN
3    1.0
4    3.0
5    NaN
6    2.0
7    1.0
8    NaN
Name: NUM_BEDROOMS, dtype: float64

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8     True
Name: NUM_BEDROOMS, dtype: bool

In [32]:
df6.dropna(inplace = True)
print(df6.to_string())

           PID  ST_NUM    ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0     PUTNAM            Y            3        1  1000
1  100002000.0   197.0  LEXINGTON            N            3      1.5    --
8  100009000.0   215.0    TREMONT            Y           na        2  1800